<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"166c317dd5a48ede995beed6492488920016a215527f68c60c1ac0ef3d27ae52","plan_job_ref":"Job Terraform Plan #20 at https://github.com/getsentry/secure-cloud-functions-template/actions/runs/23699649371","plan_out_hash":"99ec541d3202d18499d830de05e8ae3581b50d21eb16d6390266dcc76d0fd071","plan_hash":"e8dffa57fd9b0666c4556fac2a39562dea3f8c68898a68496171031dc51fbb3e","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_cloudfunctions2_function.function will be updated in-place
!~  resource "google_cloudfunctions2_function" "function" {
        id               = "projects/jeffreyhung-test/locations/us-west1/functions/get-gh-app-token"
        name             = "get-gh-app-token"
#        (11 unchanged attributes hidden)

!~      build_config {
#            (7 unchanged attributes hidden)

!~          source {
!~              storage_source {
!~                  object     = "src-0b1adba46fd182540b0929c009c93f51.zip" -> "src-354c5037c1407105821113ae15776c40.zip"
#                    (2 unchanged attributes hidden)
                }
            }

#            (1 unchanged block hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
+       content             = (sensitive value)
!~      crc32c              = "tfvhjQ==" -> (known after apply)
!~      detect_md5hash      = "CxrbpG/RglQLCSnACck/UQ==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1773245720561222 -> (known after apply)
!~      id                  = "********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "CxrbpG/RglQLCSnACck/UQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-0b1adba46fd182540b0929c009c93f51.zip?generation=1773245720561222&alt=media" -> (known after apply)
!~      name                = "src-0b1adba46fd182540b0929c009c93f51.zip" -> "src-354c5037c1407105821113ae15776c40.zip" # forces replacement
!~      output_name         = "src-0b1adba46fd182540b0929c009c93f51.zip" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-0b1adba46fd182540b0929c009c93f51.zip" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #20](https://github.com/getsentry/secure-cloud-functions-template/actions/runs/23699649371)